<a href="https://colab.research.google.com/github/engineer-nicolas/cs50sql/blob/master/lecture_5_Optimizing/lecture_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Lecture 5 - Optimizing - CS50 SQL harvard

In [1]:
# Let's import the required libraries
import sqlite3
import pandas as pd
import time
import os

Let us open up this database called movies.db in SQLite.

In [ ]:
# Let's connect to the SQLite database used in CS50
conn = sqlite3.connect("movies.db")

In [2]:
df=pd.read_sql_query(
    """
    SELECT *
    FROM sqlite_master;
    """,
    conn
)
df

,type,name,tbl_name,rootpage,sql
0,table,movies,movies,2,"CREATE TABLE ""movies"" (\n ""id"" INTEGER,\n ..."
1,table,people,people,3,"CREATE TABLE ""people"" (\n ""id"" INTEGER,\n ..."
2,table,ratings,ratings,4,"CREATE TABLE ""ratings"" (\n ""id"" INTEGER,\n ..."
3,index,sqlite_autoindex_ratings_1,ratings,5,None
4,table,stars,stars,6,"CREATE TABLE ""stars"" (\n ""movie_id"" INTEGER..."
5,index,sqlite_autoindex_stars_1,stars,7,None
6,table,sqlite_stat1,sqlite_stat1,8,"CREATE TABLE sqlite_stat1(tbl,idx,stat)"

In [3]:
for e in range(len(df)):
    print(df["sql"][e])

CREATE TABLE "movies" (
    "id" INTEGER,
    "title" TEXT NOT NULL,
    "year" NUMERIC,
    PRIMARY KEY("id")
)
CREATE TABLE "people" (
    "id" INTEGER,
    "name" TEXT NOT NULL,
    "birth" NUMERIC,
    PRIMARY KEY("id")
)
CREATE TABLE "ratings" (
    "id" INTEGER,
    "movie_id" INTEGER UNIQUE,
    "rating" REAL NOT NULL,
    "votes" INTEGER NOT NULL,
    PRIMARY KEY("id"),
    FOREIGN KEY("movie_id") REFERENCES "movies"("id")
)
None
CREATE TABLE "stars" (
    "movie_id" INTEGER,
    "person_id" INTEGER,
    PRIMARY KEY("movie_id", "person_id"),
    FOREIGN KEY("movie_id") REFERENCES "movies"("id"),
    FOREIGN KEY("person_id") REFERENCES "people"("id")
)
None
CREATE TABLE sqlite_stat1(tbl,idx,stat)

In [4]:
movies=pd.read_sql_query(
    """
    SELECT *
    FROM "movies"
    """,
    conn
)
movies

              id                                 title  year
0          11801                      Tötet nicht mehr  2019
1          13274           Istoriya grazhdanskoy voyny  2021
2          15414                La tierra de los toros  2000
3          15724                         Dama de noche  1993
4          31458              El huésped del sevillano  1970
...          ...                                   ...   ...
419001  27581096         Helt Kul - 20km Hofman - 2011  2011
419002  27583866                All the Cool One's Men  1982
419003  27584383  Leaving California: The Untold Story  2023
419004  27585151                   Bloodless Massacres  2020
419005  27585844          The Spirits of the Migration  2023

[419006 rows x 3 columns]

In [5]:
print("number of rows in movies.db:",len(movies))

number of rows in movies.db: 419006

To find the information pertaining to the movie Cars, we would run the following query:

In [6]:
start = time.perf_counter()
pd.read_sql_query(
    """
    SELECT *
    FROM "movies"
    WHERE "title" = 'Cars';
    """,
    conn
)
end = time.perf_counter()
print(f"Execution time: {end - start:.6f} seconds")

Execution time: 0.073442 seconds

SQLite has a command `.timer on` that enables us to time our queries.

We can optimize this query to be more efficient than a scan. In the same way that textbooks often have an index, databases tables can have an index as well.

## CREATE INDEX ___ ON - Index

An index is a structure used to speed up the retrieval of rows from a table.

In [7]:
conn.execute(
"""
CREATE INDEX "title_index"
ON "movies" ("title");
"""
)
conn.commit()

df=pd.read_sql_query(
    """
    SELECT *
    FROM sqlite_master;
    """,
    conn
)
df

,type,name,tbl_name,rootpage,sql
0,table,movies,movies,2,"CREATE TABLE ""movies"" (\n ""id"" INTEGER,\n ..."
1,table,people,people,3,"CREATE TABLE ""people"" (\n ""id"" INTEGER,\n ..."
2,table,ratings,ratings,4,"CREATE TABLE ""ratings"" (\n ""id"" INTEGER,\n ..."
3,index,sqlite_autoindex_ratings_1,ratings,5,None
4,table,stars,stars,6,"CREATE TABLE ""stars"" (\n ""movie_id"" INTEGER..."
5,index,sqlite_autoindex_stars_1,stars,7,None
6,table,sqlite_stat1,sqlite_stat1,8,"CREATE TABLE sqlite_stat1(tbl,idx,stat)"
7,index,title_index,movies,24511,"CREATE INDEX ""title_index""\nON ""movies"" (""title"")"

Note: `sqlite_autoindex_ratings_1` and `sqlite_autoindex_stars_1` were automatically created by SQLite to enforce `PRIMARY KEY` or `UNIQUE` constraints. These indexes are managed internally, do not have an associated `CREATE INDEX` SQL code, and cannot be dropped explicitly.

In [8]:
pd.read_sql_query(
"""
PRAGMA index_list("movies");
""",
conn
)

   seq         name  unique origin  partial
0    0  title_index       0      c        0

## EXPLAIN QUERY PLAN

In [9]:
qp=pd.read_sql_query(
"""
EXPLAIN QUERY PLAN
    SELECT *
    FROM "movies"
    WHERE "title" = 'Cars';
""",
conn
)
qp

   id  parent  notused                                           detail
0   3       0       62  SEARCH movies USING INDEX title_index (title=?)

In [10]:
print(qp["detail"][0])

SEARCH movies USING INDEX title_index (title=?)

## DROP INDEX

In [11]:
conn.execute(
"""
DROP INDEX "title_index";
"""
)
conn.commit()

df=pd.read_sql_query(
    """
    SELECT *
    FROM sqlite_master;
    """,
    conn
)
df

,type,name,tbl_name,rootpage,sql
0,table,movies,movies,2,"CREATE TABLE ""movies"" (\n ""id"" INTEGER,\n ..."
1,table,people,people,3,"CREATE TABLE ""people"" (\n ""id"" INTEGER,\n ..."
2,table,ratings,ratings,4,"CREATE TABLE ""ratings"" (\n ""id"" INTEGER,\n ..."
3,index,sqlite_autoindex_ratings_1,ratings,5,None
4,table,stars,stars,6,"CREATE TABLE ""stars"" (\n ""movie_id"" INTEGER..."
5,index,sqlite_autoindex_stars_1,stars,7,None
6,table,sqlite_stat1,sqlite_stat1,8,"CREATE TABLE sqlite_stat1(tbl,idx,stat)"

In [12]:
conn.close()
conn = sqlite3.connect("movies.db")
q=pd.read_sql_query(
"""
EXPLAIN QUERY PLAN
    SELECT *
    FROM "movies"
    WHERE "title" = 'Cars';
""",
conn
)
print(q["detail"][0])

SCAN movies

After dropping the index, the plan reverts to scanning the entire database.

## Index across Multiple Tables

To find all the movies Tom Hanks starred in, it would be necessary to run the following query:

In [13]:
tom=pd.read_sql_query(
"""
SELECT "title" FROM "movies"
WHERE "id" IN (
    SELECT "movie_id" FROM "stars"
    WHERE "person_id" = (
        SELECT "id" FROM "people"
        WHERE "name" = 'Tom Hanks'
    )
);
""",
conn
)
tom

                         title
0               Bachelor Party
1                       Splash
2    The Man with One Red Shoe
3                   Volunteers
4    Every Time We Say Goodbye
..                         ...
57           News of the World
58           A Man Called Otto
59    Served: Harvey Weinstein
60  Borat Subsequent Moviefilm
61               Asteroid City

[62 rows x 1 columns]

To understand what kind of index could help speed this query up, we can run EXPLAIN QUERY PLAN

In [14]:
qp=pd.read_sql_query(
"""
EXPLAIN QUERY PLAN
SELECT "title" FROM "movies"
WHERE "id" IN (
    SELECT "movie_id" FROM "stars"
    WHERE "person_id" = (
        SELECT "id" FROM "people"
        WHERE "name" = 'Tom Hanks'
    )
);
""",
conn
)
for e in qp["detail"]:
    print(e)

SEARCH movies USING INTEGER PRIMARY KEY (rowid=?)
LIST SUBQUERY 2
SCAN stars
SCALAR SUBQUERY 1
SCAN people
CREATE BLOOM FILTER

This shows us that the query requires 2 SCANS — of ``people`` and ``stars``.


Let's add two indexes to speed this query up.

In [15]:
conn.execute(
"""
CREATE INDEX "person_index" 
ON "stars" ("person_id");
"""
)
conn.execute(
"""
CREATE INDEX "name_index" 
ON "people" ("name");
"""
)
conn.commit()

df=pd.read_sql_query(
    """
    SELECT *
    FROM sqlite_master
    WHERE "type"='index';
    """,
    conn
)
df

,type,name,tbl_name,rootpage,sql
0,index,sqlite_autoindex_ratings_1,ratings,5,None
1,index,sqlite_autoindex_stars_1,stars,7,None
2,index,person_index,stars,24511,"CREATE INDEX ""person_index"" \nON ""stars"" (""per..."
3,index,name_index,people,28885,"CREATE INDEX ""name_index"" \nON ""people"" (""name"")"

Now, we run EXPLAIN QUERY PLAN with the same nested query. We can observe that
all the scans are now searches using indexes

In [16]:
qp=pd.read_sql_query(
"""
EXPLAIN QUERY PLAN
SELECT "title" FROM "movies"
WHERE "id" IN (
    SELECT "movie_id" FROM "stars"
    WHERE "person_id" = (
        SELECT "id" FROM "people"
        WHERE "name" = 'Tom Hanks'
    )
);
""",
conn
)
for e in qp["detail"]:
    print(e)

SEARCH movies USING INTEGER PRIMARY KEY (rowid=?)
LIST SUBQUERY 2
SEARCH stars USING INDEX person_index (person_id=?)
SCALAR SUBQUERY 1
SEARCH people USING COVERING INDEX name_index (name=?)
CREATE BLOOM FILTER

The search on the table ``people`` uses something called a ``COVERING INDEX``

## Covering index

A covering index means that all the information needed for the query can be found within the index itself.

To allow the query on the "stars" table to use a covering index as well, we can include "movie_id" in the index created on "stars". 

This will ensure that the information being looked up (movie ID) and the value being searched on (person ID) are both be in the index

In [17]:
# Delete old index on the "stars" table
conn.execute(
"""
DROP INDEX "person_index";
"""
)
#  Create new covering index
conn.execute(
"""
CREATE INDEX "person_index" 
ON "stars" ("person_id", "movie_id");
"""
)
conn.commit()

df=pd.read_sql_query(
    """
    SELECT *
    FROM sqlite_master
    WHERE "type"='index';
    """,
    conn
)
df

,type,name,tbl_name,rootpage,sql
0,index,sqlite_autoindex_ratings_1,ratings,5,None
1,index,sqlite_autoindex_stars_1,stars,7,None
2,index,name_index,people,28885,"CREATE INDEX ""name_index"" \nON ""people"" (""name"")"
3,index,person_index,stars,24511,"CREATE INDEX ""person_index"" \nON ""stars"" (""per..."

In [18]:
qp=pd.read_sql_query(
"""
EXPLAIN QUERY PLAN
SELECT "title" FROM "movies"
WHERE "id" IN (
    SELECT "movie_id" FROM "stars"
    WHERE "person_id" = (
        SELECT "id" FROM "people"
        WHERE "name" = 'Tom Hanks'
    )
);
""",
conn
)
for e in qp["detail"]:
    print(e)

SEARCH movies USING INTEGER PRIMARY KEY (rowid=?)
LIST SUBQUERY 2
SEARCH stars USING COVERING INDEX person_index (person_id=?)
SCALAR SUBQUERY 1
SEARCH people USING COVERING INDEX name_index (name=?)
CREATE BLOOM FILTER

Now there are two covering indexes, which should result in a much faster search!

## Space and Time Trade-off

Space Trade-off: Indexes occupy additional space in the database, so while we gain query speed, we do lose space because they are stored as a data structure called a B-Tree or balanced tree.

Time Trade-off: Indexes speed up reads (`SELECT`) but slow down writes (`INSERT`, `UPDATE`, `DELETE`)
because the index must also be updated.

## CREATE INDEX + WHERE - Partial Index

This is an index that includes only a subset of rows from a table, allowing us to save some space and it is especially useful when users frequently query only a subset of rows from the table.

For example, let’s create a partial index for movies released in 2023.

In [19]:
conn.execute(
"""
CREATE INDEX "recents" ON "movies" ("title")
WHERE "year" = 2023;
"""
)
conn.commit()
df=pd.read_sql_query(
    """
    SELECT *
    FROM sqlite_master
    WHERE "type"='index';
    """,
    conn
)
df

,type,name,tbl_name,rootpage,sql
0,index,sqlite_autoindex_ratings_1,ratings,5,None
1,index,sqlite_autoindex_stars_1,stars,7,None
2,index,name_index,people,28885,"CREATE INDEX ""name_index"" \nON ""people"" (""name"")"
3,index,person_index,stars,24511,"CREATE INDEX ""person_index"" \nON ""stars"" (""per..."
4,index,recents,movies,37703,"CREATE INDEX ""recents"" ON ""movies"" (""title"")\n..."


We can check that searching for movies released in 2023 uses the new index.

In [20]:
qp=pd.read_sql_query(
"""
EXPLAIN QUERY PLAN
SELECT "title" 
FROM "movies"
WHERE "year" = 2023;
""",
conn
)
for e in qp["detail"]:
    print(e)

SCAN movies USING COVERING INDEX recents

SQLite is scanning the index, not the table. This is normal for partial indexes or non-selective queries.

## VACUUM

In SQLite, deleting rows does not shrink the database file. ``VACUUM`` is required to reclaim disk space.

Deleted data is not immediately removed from disk in SQLite; it is only marked as free space for future inserts. As a result, deleting rows does not reduce the size of the database file.The ``VACUUM`` command, provided by SQLite, rewrites the database file and removes previously deleted data permanently.

In [21]:
import os

file="movies.db"
size_bytes = os.path.getsize(file)
print(f"Initial Size - Database {file}: {size_bytes / (1024**2):.2f} MB")

Initial Database movies.db size: 147.49 MB

In [22]:
# Delete indexes
conn.execute(
"""
DROP INDEX "name_index";
"""
)
conn.execute(
"""
DROP INDEX "person_index";
"""
)
conn.execute(
"""
DROP INDEX "recents";
"""
)
size_bytes = os.path.getsize("movies.db")
print(f"Size after DROP INDEX: {size_bytes / (1024**2):.3f} MB")

Size after DROP INDEX: 147.488 MB

We see that the size of the database has not decreased! To actually clean up the deleted space, we need to vacuum it.

In [23]:
before = os.path.getsize("movies.db")
print(f"Size before VACUUM: {before / (1024**2):.2f} MB")

conn.execute("VACUUM;")

after = os.path.getsize("movies.db")
print(f"Size after VACUUM: {after / (1024**2):.2f} MB")

Size before VACUUM: 147.49 MB
Size after VACUUM: 95.74 MB

Once we drop all the indexes and vacuum again, the database will be around 100 MB, which is considerably smaller than 150 MB.

## Concurrency and Transactions

Concurrency is the simultaneous handling of multiple queries or interactions by the database.

In database terminology, a transaction is an individual unit of work — something that cannot be broken down into smaller pieces.

Transactions have some properties, which can be remembered using the acronym ACID:
- Atomicity: can’t be broken down into smaller pieces,
- Consistency: should not violate a database constraint,
- Isolation: if multiple users access a database, their transactions cannot interfere with each other,
- Durability: in case of any failure within the database, all data changed by transactions will remain.

Let’s open up bank.db so we can implement a transaction for transferring money from Alice to Bob!

In [3]:
#Delete only if it already exists
DB_NAME = "bank.db"
# Safety check: delete if the filename is exactly what we expect
if os.path.exists(DB_NAME) and DB_NAME.endswith(".db"):
    os.remove(DB_NAME)

In [4]:
bank_db_string_format="""
BEGIN TRANSACTION;
CREATE TABLE "accounts" (
    "id" INTEGER,
    "name" TEXT NOT NULL,
    "balance" INTEGER NOT NULL CHECK("balance" >= 0),
    PRIMARY KEY("id")
);
INSERT INTO "accounts" VALUES(1,'Alice',10);
INSERT INTO "accounts" VALUES(2,'Bob',20);
INSERT INTO "accounts" VALUES(3,'Charlie',30);
COMMIT;
"""

# Let's connect to the SQLite database used in CS50
conn = sqlite3.connect("bank.db")
conn.executescript(bank_db_string_format)
conn.commit()

In [5]:
pd.read_sql_query(
"""
SELECT * FROM "accounts";
""",
conn
)

   id     name  balance
0   1    Alice       10
1   2      Bob       20
2   3  Charlie       30

## BEGIN TRANSACTION + COMMIT


To move $10 from Alice’s account to Bob’s, we should write the following transaction:

In [6]:
conn.executescript("""
BEGIN TRANSACTION;
UPDATE "accounts" SET "balance" = "balance" + 10 WHERE "id" = 2;
UPDATE "accounts" SET "balance" = "balance" - 10 WHERE "id" = 1;
COMMIT;
""")

pd.read_sql_query(
"""
SELECT * FROM "accounts";
""",
conn
)

   id     name  balance
0   1    Alice        0
1   2      Bob       30
2   3  Charlie       30

If we execute the query after writing the UPDATE statements, but without committing, neither of the two UPDATE statements will be run! This helps keep the transaction atomic.

## BEGIN TRANSACTION + ROLLBACK

If an error occurs inside a transaction, executing `ROLLBACK`
restores the database to its original state before `BEGIN TRANSACTION`.

To move again $10 from Alice’s account to Bob’s, we should write the following transaction:

In [7]:
# Show initial state
print("Initial state:")
initial_state=pd.read_sql_query(
    """
    SELECT "id", "name", "balance"
    FROM "accounts";
    """,
    conn
)
print(initial_state)

# Begin transaction
conn.execute("""BEGIN TRANSACTION;""")
print("\nBEGIN TRANSACTION;")

# Bob receives 10
conn.execute(
    """UPDATE "accounts" SET "balance" = "balance" + 10 WHERE "id" = 2;"""
)
print("""UPDATE "accounts" SET "balance" = "balance" + 10 WHERE "id" = 2;""")
print("\nAfter first update (crediting Bob):")
first_update=pd.read_sql_query(
    """
    SELECT "id", "name", "balance"
    FROM "accounts";
    """,
    conn
)
print(first_update)

Initial state:
   id     name  balance
0   1    Alice        0
1   2      Bob       30
2   3  Charlie       30

BEGIN TRANSACTION;
UPDATE "accounts" SET "balance" = "balance" + 10 WHERE "id" = 2;

After first update (crediting Bob):
   id     name  balance
0   1    Alice        0
1   2      Bob       40
2   3  Charlie       30

In [8]:
try:
    # Alice tries to send 10 (this will fail)
    conn.execute(
        """UPDATE "accounts" SET "balance" = "balance" - 10 WHERE "id" = 1;"""
    )
except Exception as e:
    print("\nLast SQL statement failed. The error was:")
    print(type(e).__name__,":", e)

    # Rollback
    conn.execute("""ROLLBACK;""")

    print("\nAll SQL statements are rolled back, reverting the database to its previous state.")
finally:
    # Final state 
    print("\nFinal state:")
    print(
        pd.read_sql_query(
            """
            SELECT "id", "name", "balance"
            FROM "accounts";
            """,
            conn
        )
    )

Last SQL statement failed. The error was:
IntegrityError : CHECK constraint failed: balance

All SQL statements are rolled back, reverting the database to its previous state.

Final state:
   id     name  balance
0   1    Alice        0
1   2      Bob       30
2   3  Charlie       30

Once we begin a transaction and write some SQL statements, if any of them fail, we can end it with a ROLLBACK to revert all values to their pre-transaction state. This helps keep transactions consistent.

In [9]:
conn.close()

## Race Conditions

A race condition occurs when multiple entities simultaneously access and make decisions based on a shared value, potentially causing inconsistencies in the database. Unresolved race conditions can be exploited by hackers to manipulate the database.

To make transactions sequential, SQLite and other database management systems use locks on databases. A table in a database could be in a few different states:
- UNLOCKED: this is the default state when no user is accessing the database,
- SHARED: when a transaction is reading data from the database, it obtains shared lock that allows other transactions to read simultaneously from the database,
- EXCLUSIVE: if a transaction needs to write or update data, it obtains an exclusive lock on the database that does not allow other transactions to occur at the same time (not even a read)

In [10]:
conn1 = sqlite3.connect("bank.db", timeout=1)
conn2 = sqlite3.connect("bank.db", timeout=1)

In [11]:
conn1.execute("BEGIN EXCLUSIVE;")
conn1.execute("""
INSERT INTO "accounts" VALUES(4,'Exclusive Edward',10);
""")

In [12]:
try:
    # Second connection
    conn2.execute("""SELECT * FROM "accounts";""")
except Exception as e:
    print("Last SQL statement failed. The error was:")
    print(type(e).__name__,":", e)
finally:
    conn1.execute("""COMMIT;""")
    print("\nFirst connection realize commit and unlock database")
    cursor = conn2.execute("""SELECT * FROM "accounts";""")
    print("\nSecond connection can read database. The result is:")
    for row in cursor:
        print(row)

Last SQL statement failed. The error was:
OperationalError : database is locked

First connection realize commit and unlock database

Second connection can read database. The result is:
(1, 'Alice', 0)
(2, 'Bob', 30)
(3, 'Charlie', 30)
(4, 'Exclusive Edward', 10)

In [13]:
conn1.close()
conn2.close()